#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-azuread_repo_4A45B05B: Preparing import... [id=cdktn-provider-azuread]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 4s [id=15746607]
github_repository.cdktn-provider-azuread-go_repo_9852A552: Preparing import... [id=cdktn-provider-azuread-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-azuread_repo_secret-alert-prs-slack-webhook-url_323EFE9C will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-alert-prs-slack-webhook-url_323EFE9C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-id-alias-PROJEN_APP_ID_DFD07133 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-id-alias-PROJEN_APP_ID_DFD07133" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-id_B2B5D65A will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-id_B2B5D65A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_9715E4A7 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_9715E4A7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-app-private-key_F5C891A4 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-app-private-key_F5C891A4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13F040FC will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13F040FC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8B20B4DD will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8B20B4DD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-gh-token_07E6F8B2 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-gh-token_07E6F8B2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-npm-token_2F8F7884 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-npm-token_2F8F7884" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-twine-password_D210EC70 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-twine-password_D210EC70" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azuread_repo_secret-twine-username_2177FAE1 will be created
  + resource "github_actions_secret" "cdktn-provider-azuread_repo_secret-twine-username_2177FAE1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azuread"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-azuread_repository-setup_main-protection_D77E1F19 will be created
  + resource "github_branch_protection" "cdktn-provider-azuread_repository-setup_main-protection_D77E1F19" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-azuread"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-azuread-go_repository-setup_auto-approve-label_2EF900E0 will be created
  + resource "github_issue_label" "cdktn-provider-azuread-go_repository-setup_auto-approve-label_2EF900E0" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azuread-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azuread-go_repository-setup_automerge-label_3FA742B5 will be created
  + resource "github_issue_label" "cdktn-provider-azuread-go_repository-setup_automerge-label_3FA742B5" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azuread-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azuread-go_repository-setup_no-auto-close-label_27F6E818 will be created
  + resource "github_issue_label" "cdktn-provider-azuread-go_repository-setup_no-auto-close-label_27F6E818" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azuread-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azuread_repository-setup_auto-approve-label_4E4FCCA0 will be created
  + resource "github_issue_label" "cdktn-provider-azuread_repository-setup_auto-approve-label_4E4FCCA0" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azuread"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azuread_repository-setup_automerge-label_2F0F4777 will be created
  + resource "github_issue_label" "cdktn-provider-azuread_repository-setup_automerge-label_2F0F4777" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azuread"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azuread_repository-setup_no-auto-close-label_E0E56ABE will be created
  + resource "github_issue_label" "cdktn-provider-azuread_repository-setup_no-auto-close-label_E0E56ABE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azuread"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-azuread-go_repo_9852A552 will be updated in-place
  # (imported from "cdktn-provider-azuread-go")
  ~ resource "github_repository" "cdktn-provider-azuread-go_repo_9852A552" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for azuread."
        etag                        = "W/\"d18c19f0d9729b3fb4801cebb13ae64c15709286056b706f282aa387563ffec2\""
        full_name                   = "cdktn-io/cdktn-provider-azuread-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-azuread-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-azuread-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-azuread-go.git"
        id                          = "cdktn-provider-azuread-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-azuread-go"
        node_id                     = "R_kgDORTgyRg"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1161310790
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-azuread-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-azuread-go"
      ~ topics                      = [
          + "azuread",
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-azuread_repo_4A45B05B will be updated in-place
  # (imported from "cdktn-provider-azuread")
  ~ resource "github_repository" "cdktn-provider-azuread_repo_4A45B05B" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for azuread."
        etag                        = "W/\"461d9f0b47575bb98f5d8a7d6c09bda2bea031861f6f9f9773b5148153329aed\""
        full_name                   = "cdktn-io/cdktn-provider-azuread"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-azuread.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-azuread"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-azuread.git"
        id                          = "cdktn-provider-azuread"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-azuread"
        node_id                     = "R_kgDORTgwyA"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1161310408
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-azuread.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-azuread"
      ~ topics                      = [
          + "azuread",
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-azuread_dependabot-security_14A6B07D will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-azuread_dependabot-security_14A6B07D" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-azuread"
    }

  # github_repository_webhook.cdktn-provider-azuread-go_repository-setup_slack-webhook_655D0305 will be created
  + resource "github_repository_webhook" "cdktn-provider-azuread-go_repository-setup_slack-webhook_655D0305" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azuread-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-azuread_repository-setup_slack-webhook_FD9C0190 will be created
  + resource "github_repository_webhook" "cdktn-provider-azuread_repository-setup_slack-webhook_FD9C0190" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azuread"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-azuread-go_repository-setup_managing-team_B3C05A03 will be created
  + resource "github_team_repository" "cdktn-provider-azuread-go_repository-setup_managing-team_B3C05A03" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-azuread-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-azuread_repository-setup_managing-team_4739B99D will be created
  + resource "github_team_repository" "cdktn-provider-azuread_repository-setup_managing-team_4739B99D" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-azuread"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (1 unchanged element hidden)
        "github_repository.cdktn-provider-aws_repo_45EAAAF4.ssh_clone_url",
      + "github_repository.cdktn-provider-azuread_repo_4A45B05B.ssh_clone_url",
        "github_repository.cdktn-provider-azurerm_repo_25F8C0DE.ssh_clone_url",
        # (13 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*